/* Copyright (c) Mark Harmstone 2024
 *
 * This file is part of tdscpp.
 *
 * tdscpp is free software: you can redistribute it and/or modify
 * it under the terms of the GNU Lesser General Public Licence as published by
 * the Free Software Foundation, either version 3 of the Licence, or
 * (at your option) any later version.
 *
 * tdscpp is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU Lesser General Public Licence for more details.
 *
 * You should have received a copy of the GNU Lesser General Public Licence
 * along with tdscpp.  If not, see <http://www.gnu.org/licenses/>. */

#pragma once

#include <string>
#include <cstdint>
#include <thread>
#include <condition_variable>
#include <format>
#include "config.h"

#ifdef _WIN32
#define SECURITY_WIN32
#include <windows.h>
#include <sspi.h>
#endif

#ifdef WITH_OPENSSL
#include <openssl/ssl.h>
#include <openssl/bio.h>
#include <openssl/err.h>
#include <openssl/conf.h>
#include <openssl/x509v3.h>
#endif

class formatted_error : public std::exception {
public:
    template<typename... Args>
    formatted_error(std::format_string<Args...> s, Args&&... args) : msg(std::format(s, std::forward<Args>(args)...)) {
    }

    const char* what() const noexcept {
        return msg.c_str();
    }

private:
    std::string msg;
};

enum class tds_msg : uint8_t {
    sql_batch = 1,
    pretds7_login,
    rpc,
    tabular_result,
    attention_signal = 6,
    bulk_load_data,
    federated_auth_token,
    trans_man_req = 14,
    tds7_login = 16,
    sspi,
    prelogin
};

struct tds_header {
    enum tds_msg type;
    uint8_t status;
    uint16_t length;
    uint16_t spid;
    uint8_t packet_id;
    uint8_t window;
};

static_assert(sizeof(tds_header) == 8, "tds_header has wrong size");

enum class tds_login_opt_type : uint8_t {
    version = 0,
    encryption,
    instopt,
    threadid,
    mars,
    traceid,
    fedauthrequired,
    nonceopt,
    terminator = 0xff
};

struct login_opt {
    login_opt(enum tds_login_opt_type type, std::span<const uint8_t> payload) : type(type), payload(payload.data(), payload.data() + payload.size()) { }

    template<typename T>
    requires std::is_integral_v<T> || std::is_enum_v<T>
    login_opt(enum tds_login_opt_type type, T payload) : login_opt(type, std::span{(const uint8_t*)&payload, sizeof(payload)}) { }

    enum tds_login_opt_type type;
    std::vector<uint8_t> payload;
};

struct login_opt_version {
    uint8_t major;
    uint8_t minor;
    uint16_t build;
    uint16_t subbuild;
};

static_assert(sizeof(login_opt_version) == 6, "login_opt_version has wrong size");

#pragma pack(push,1)

struct tds_login_opt {
    enum tds_login_opt_type type;
    uint16_t offset;
    uint16_t length;
};

#pragma pack(pop)

static_assert(sizeof(tds_login_opt) == 5, "tds_login_opt has wrong size");

#pragma pack(push,1)

struct tds_login_msg {
    uint32_t length;
    uint32_t tds_version;
    uint32_t packet_size;
    uint32_t client_version;
    uint32_t client_pid;
    uint32_t connexion_id;
    uint8_t option_flags1;
    uint8_t option_flags2;
    struct {
        uint8_t sql_type : 4;
        uint8_t oledb : 1;
        uint8_t read_only_intent : 1;
        uint8_t reserved : 2;
    } sql_type_flags;
    uint8_t option_flags3;
    int32_t timezone;
    uint32_t collation;
    uint16_t client_name_offset;
    uint16_t client_name_length;
    uint16_t username_offset;
    uint16_t username_length;
    uint16_t password_offset;
    uint16_t password_length;
    uint16_t app_name_offset;
    uint16_t app_name_length;
    uint16_t server_name_offset;
    uint16_t server_name_length;
    uint16_t extension_offset;
    uint16_t extension_length;
    uint16_t interface_library_offset;
    uint16_t interface_library_length;
    uint16_t locale_offset;
    uint16_t locale_length;
    uint16_t database_offset;
    uint16_t database_length;
    uint8_t mac_address[6];
    uint16_t sspi_offset;
    uint16_t sspi_length;
    uint16_t attach_db_offset;
    uint16_t attach_db_length;
    uint16_t new_password_offset;
    uint16_t new_password_length;
    uint32_t sspi_long;
};

#pragma pack(pop)

static_assert(sizeof(tds_login_msg) == 94, "tds_login_msg has wrong size");

#pragma pack(push,1)

struct tds_done_msg {
    uint16_t status;
    uint16_t curcmd;
    uint64_t rowcount;
};

static_assert(sizeof(tds_done_msg) == 12, "tds_done_msg has wrong size");

struct tds_header_trans_desc {
    uint16_t type;
    uint64_t descriptor;
    uint32_t outstanding;
};

static_assert(sizeof(tds_header_trans_desc) == 14, "tds_header_trans_desc has wrong size");

struct tds_all_headers {
    uint32_t total_size;
    uint32_t size;
    tds_header_trans_desc trans_desc;
};

static_assert(sizeof(tds_all_headers) == 22, "tds_all_headers has wrong size");

struct tds_rpc_batch {
    tds_all_headers all_headers;
    uint16_t proc_id_switch;
    uint16_t proc_id;
    uint16_t flags;
};

static_assert(sizeof(tds_rpc_batch) == 28, "tds_rpc_batch has wrong size");

namespace tds {
    enum class sql_type : uint8_t;
}

struct tds_param_header {
    uint8_t name_len;
    uint8_t flags;
    tds::sql_type type;
};

struct tds_INT_param {
    tds_param_header h;
    uint8_t max_length;
    uint8_t length;
};

static_assert(sizeof(tds_INT_param) == 5, "tds_INT_param has wrong size");

struct tds_VARCHAR_param {
    tds_param_header h;
    uint16_t max_length;
    tds::collation collation;
    uint16_t length;
};

static_assert(sizeof(tds_VARCHAR_param) == 12, "tds_VARCHAR_param has wrong size");

struct tds_VARCHAR_MAX_param {
    tds_param_header h;
    uint16_t max_length;
    tds::collation collation;
    uint64_t length;
    uint32_t chunk_length;
};

static_assert(sizeof(tds_VARCHAR_MAX_param) == 22, "tds_VARCHAR_MAX_param has wrong size");

struct tds_VARBINARY_param {
    tds_param_header h;
    uint16_t max_length;
    uint16_t length;
};

static_assert(sizeof(tds_VARBINARY_param) == 7, "tds_VARBINARY_param has wrong size");

struct tds_VARBINARY_MAX_param {
    tds_param_header h;
    uint16_t max_length;
    uint64_t length;
    uint32_t chunk_length;
};

static_assert(sizeof(tds_VARBINARY_MAX_param) == 17, "tds_VARBINARY_MAX_param has wrong size");

struct tds_XML_param {
    tds_param_header h;
    uint8_t flags;
    uint64_t length;
    uint32_t chunk_length;
};

static_assert(sizeof(tds_XML_param) == 16, "tds_XML_param has wrong size");

struct tds_return_value {
    uint16_t param_ordinal;
    uint8_t param_name_len;
    // FIXME - then param name if present
    uint8_t status;
    uint32_t user_type;
    uint16_t flags;
    tds::sql_type type;
};

static_assert(sizeof(tds_return_value) == 11, "tds_return_value has wrong size");

enum class tds_tm_type : uint16_t {
    TM_GET_DTC_ADDRESS = 0,
    TM_PROPAGATE_XACT = 1,
    TM_BEGIN_XACT = 5,
    TM_PROMOTE_XACT = 6,
    TM_COMMIT_XACT = 7,
    TM_ROLLBACK_XACT = 8,
    TM_SAVE_XACT = 9
};

struct tds_tm_msg {
    tds_all_headers all_headers;
    enum tds_tm_type type;
};

static_assert(sizeof(tds_tm_msg) == 24, "tds_tm_msg has wrong size");

struct tds_tm_begin {
    tds_tm_msg header;
    uint8_t isolation_level;
    uint8_t name_len;
};

static_assert(sizeof(tds_tm_begin) == 26, "tds_tm_begin has wrong size");

struct tds_tm_rollback {
    tds_tm_msg header;
    uint8_t name_len;
    uint8_t flags;
};

static_assert(sizeof(tds_tm_rollback) == 26, "tds_tm_rollback has wrong size");

struct tds_tm_commit {
    tds_tm_msg header;
    uint8_t name_len;
    uint8_t flags;
};

static_assert(sizeof(tds_tm_commit) == 26, "tds_tm_commit has wrong size");

enum class tds_envchange_type : uint8_t {
    database = 1,
    language,
    charset,
    packet_size,
    unicode_data_sort_local_id,
    unicode_data_sort_comparison_flags,
    collation,
    begin_trans,
    commit_trans,
    rollback_trans,
    enlist_dist_trans,
    defect_trans,
    log_shipping,
    promote_trans = 15,
    trans_man_address,
    trans_ended,
    reset_completion_acknowledgement,
    user_instance_started,
    routing
};

struct tds_envchange {
    enum tds::token token;
    uint16_t length;
    enum tds_envchange_type type;
};

static_assert(sizeof(tds_envchange) == 4, "tds_envchange has wrong size");

struct tds_envchange_begin_trans {
    struct tds_envchange header;
    uint8_t new_len;
    uint64_t trans_id;
    uint8_t old_len;
};

static_assert(sizeof(tds_envchange_begin_trans) == 14, "tds_envchange_begin_trans has wrong size");

struct tds_envchange_rollback_trans {
    struct tds_envchange header;
    uint8_t new_len;
    uint8_t old_len;
    uint64_t trans_id;
};

static_assert(sizeof(tds_envchange_rollback_trans) == 14, "tds_envchange_rollback_trans has wrong size");

struct tds_envchange_commit_trans {
    struct tds_envchange header;
    uint8_t new_len;
    uint8_t old_len;
    uint64_t trans_id;
};

static_assert(sizeof(tds_envchange_commit_trans) == 14, "tds_envchange_commit_trans has wrong size");

struct tds_envchange_packet_size {
    struct tds_envchange header;
    uint8_t new_len;
};

static_assert(sizeof(tds_envchange_packet_size) == 5, "tds_envchange_packet_size has wrong size");

struct tds_envchange_database {
    struct tds_envchange header;
    uint8_t name_len;
};

static_assert(sizeof(tds_envchange_database) == 5, "tds_envchange_database has wrong size");

struct tds_envchange_collation {
    struct tds_envchange header;
    uint8_t new_len;
    tds::collation collation;
};

static_assert(sizeof(tds_envchange_collation) == 10, "tds_envchange_collation has wrong size");

struct tds_info_msg {
    int32_t msgno;
    uint8_t state;
    uint8_t severity;
};

static_assert(sizeof(tds_info_msg) == 6, "tds_info_msg has wrong size");

enum class tds_feature : uint8_t {
    SESSIONRECOVERY = 0x1,
    FEDAUTH = 0x2,
    COLUMNENCRYPTION = 0x4,
    GLOBALTRANSACTIONS = 0x5,
    AZURESQLSUPPORT = 0x8,
    DATACLASSIFICATION = 0x9,
    UTF8_SUPPORT = 0xa,
    AZURESQLDNSCACHING = 0xb,
    TERMINATOR = 0xff
};

enum class smp_message_type : uint8_t {
    SYN = 0x01,
    ACK = 0x02,
    FIN = 0x04,
    DATA = 0x08
};

struct smp_header {
    uint8_t smid;
    smp_message_type flags;
    uint16_t sid;
    uint32_t length;
    uint32_t seqnum;
    uint32_t wndw;
};

static_assert(sizeof(smp_header) == 16, "smp_header has wrong size");

#pragma pack(pop)

#ifdef _WIN32

class handle_closer {
public:
    typedef HANDLE pointer;

    void operator()(HANDLE h) {
        if (h == INVALID_HANDLE_VALUE)
            return;

        CloseHandle(h);
    }
};

using unique_handle = std::unique_ptr<HANDLE, handle_closer>;

#else

class unique_handle {
public:
    unique_handle() : fd(0) {
    }

    explicit unique_handle(int fd) : fd(fd) {
    }

    unique_handle(unique_handle&& that) noexcept {
        fd = that.fd;
        that.fd = 0;
    }

    unique_handle(const unique_handle&) = delete;
    unique_handle& operator=(const unique_handle&) = delete;

    unique_handle& operator=(unique_handle&& that) noexcept {
        if (fd > 0)
            close(fd);

        fd = that.fd;
        that.fd = 0;

        return *this;
    }

    ~unique_handle() {
        if (fd <= 0)
            return;

        close(fd);
    }

